<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple Computer//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>RestartAction</key>
	<string>None</string>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>Apple</string>
	</array>
	<key>description</key>
	<string>Apple Rosetta for PPC support</string>
	<key>display_name</key>
	<string>Rosetta</string>
	<key>installed_size</key>
	<integer>2206</integer>
	<key>installer_item_hash</key>
	<string>1c68ed3795810c1f4f41fb09f14aa555c342c654733116466b8aef1348c772b7</string>
	<key>installer_item_location</key>
	<string>Apple/Rosetta/10.6/Rosetta.pkg</string>
	<key>installer_item_size</key>
	<integer>1959</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>Rosetta</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>installed_size</key>
			<integer>2206</integer>
			<key>packageid</key>
			<string>com.apple.pkg.Rosetta</string>
			<key>version</key>
			<string>10.6.0.1.1.1249367152</string>
		</dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>10.6.0.1.1.1249367152</string>
</dict>
</plist>
