<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
	</array>
	<key>installer_item_hash</key>
	<string>8693cddd367c8bfe7d8868f90be29958a2860d63703369b637a232f7c51f4d04</string>
	<key>installer_item_location</key>
	<string>Epson/Epson Scan/3.4.5/Epson.dmg</string>
	<key>installer_item_size</key>
	<integer>4241</integer>
	<key>installer_type</key>
	<string>copy_from_dmg</string>
	<key>installs</key>
	<array>
		<dict>
			<key>CFBundleIdentifier</key>
			<string>com.epson.scan.standalone</string>
			<key>CFBundleName</key>
			<string>EPSON Scan</string>
			<key>CFBundleShortVersionString</key>
			<string>3.4.5</string>
			<key>path</key>
			<string>/Applications/Epson/EPSON Scan.app</string>
			<key>type</key>
			<string>application</string>
		</dict>
	</array>
	<key>items_to_copy</key>
	<array>
		<dict>
			<key>destination_path</key>
			<string>/Applications/Epson</string>
			<key>source_item</key>
			<string>EPSON Scan.app</string>
		</dict>
		<dict>
                        <key>destination_path</key>
                        <string>/Applications/Epson</string>
                        <key>source_item</key>
                        <string>guide</string>
                </dict>
		<dict>
                        <key>destination_path</key>
                        <string>/Applications/Epson</string>
                        <key>source_item</key>
                        <string>Expression 10000XL Ref Guide</string>
                </dict>
	</array>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>EpsonScanner</string>
	<key>uninstall_method</key>
	<string>remove_copied_items</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>3.4.5</string>
	<key>preinstall_script</key>
	<string>#!/bin/bash
	  mkdir "/Applications/Epson"
	</string>
</dict>
</plist>
