<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
		<string>Lame</string>
	</array>
	<key>description</key>
	<string></string>
	<key>display_name</key>
	<string>Lame Library v3.98.2 for Audacity</string>
	<key>installed_size</key>
	<integer>740</integer>
	<key>installer_item_hash</key>
	<string>5ef5dca6c6dccb06366b44f2b3fc281a496a87247d23e123e133536f929bcb56</string>
	<key>installer_item_location</key>
	<string>Lame/3.98.2/Lame_Library_v3.98.2_for_Audacity_on_OSX.dmg</string>
	<key>installer_item_size</key>
	<integer>245</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>Lame Library</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>Lame Library v3.98.2 for Audacity.pkg</string>
			<key>installed_size</key>
			<integer>740</integer>
			<key>packageid</key>
			<string>com.sourceforge.audacity.lameLibraryForAudacity.pkg</string>
			<key>version</key>
			<string>1</string>
		</dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>3.98.2</string>
</dict>
</plist>
