<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>cul</string>
	</array>
	<key>description</key>
	<string>Licenses Toast for CUL machines</string>
	<key>display_name</key>
	<string>ToastLicense</string>
	<key>installed_size</key>
	<integer>4</integer>
	<key>installer_item_hash</key>
	<string>9092fd814f4373e476f9a9d60d70f5f96785ebe5dd3d54de860cfc28b1d0a446</string>
	<key>installer_item_location</key>
	<string>cul/serialization/toast/ToastLicense.dmg</string>
	<key>installer_item_size</key>
	<integer>19</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>ToastLicense</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>ToastLicense.pkg</string>
			<key>installed_size</key>
			<integer>4</integer>
			<key>packageid</key>
			<string>edu.columbia.toastlicense.com.roxio.Toast.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>1.0</string>
</dict>
</plist>
