<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>Microsoft</string>
	</array>
	<key>description</key>
	<string>Office 2008 SP1 Update</string>
	<key>display_name</key>
	<string>Office 2008 SP1 Update (12.1.0)</string>
	<key>installed_size</key>
	<integer>560232</integer>
	<key>installer_item_hash</key>
	<string>4d8fdf4243a9584e6f835887b6e04574bf4ebeea64042ca4a0a0bfb3eb4b9a36</string>
	<key>installer_item_location</key>
	<string>Microsoft/Office/2008/Patches/Office2008-1210UpdateEN.dmg</string>
	<key>installer_item_size</key>
	<integer>184522</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>Office2008Update</string>
	<key>installs</key>
        <array>
          <dict>
            <key>type</key>
            <string>plist</string>
            <key>path</key>
            <string>/Applications/Microsoft Office 2008/Office/MicrosoftComponentPlugin.framework/Resources/Info.plist</string>
            <key>CFBundleShortVersionString</key>
            <string>12.1.0</string>
          </dict>
        </array>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>Office2008_en_autoupdate_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>2820</integer>
			<key>packageid</key>
			<string>com.microsoft.office.autoupdate.pkg</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_word_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>51588</integer>
			<key>packageid</key>
			<string>com.microsoft.office.word.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_word_help_std_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>352</integer>
			<key>packageid</key>
			<string>com.microsoft.office.word_help_std.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_word_help_hse_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>352</integer>
			<key>packageid</key>
			<string>com.microsoft.office.word_help_hse.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_word_help_wda_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>348</integer>
			<key>packageid</key>
			<string>com.microsoft.office.word_help_wda.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_slt_standalone_word_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>316</integer>
			<key>packageid</key>
			<string>com.microsoft.office.slt_standalone_word.pkg</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_excel_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>43436</integer>
			<key>packageid</key>
			<string>com.microsoft.office.excel.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_excel_help_std_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>948</integer>
			<key>packageid</key>
			<string>com.microsoft.office.excel_help_std.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_excel_help_hse_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>948</integer>
			<key>packageid</key>
			<string>com.microsoft.office.excel_help_hse.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_excel_help_xla_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>948</integer>
			<key>packageid</key>
			<string>com.microsoft.office.excel_help_xla.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_slt_standalone_excel_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>316</integer>
			<key>packageid</key>
			<string>com.microsoft.office.slt_standalone_excel.pkg</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_powerpoint_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>35352</integer>
			<key>packageid</key>
			<string>com.microsoft.office.powerpoint.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_powerpoint_help_std_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>464</integer>
			<key>packageid</key>
			<string>com.microsoft.office.powerpoint_help_std.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_powerpoint_help_hse_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>464</integer>
			<key>packageid</key>
			<string>com.microsoft.office.powerpoint_help_hse.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_powerpoint_help_ppa_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>464</integer>
			<key>packageid</key>
			<string>com.microsoft.office.powerpoint_help_ppa.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_slt_standalone_powerpoint_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>316</integer>
			<key>packageid</key>
			<string>com.microsoft.office.slt_standalone_powerpoint.pkg</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_entourage_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>38252</integer>
			<key>packageid</key>
			<string>com.microsoft.office.entourage.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_entourage_help_std_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>832</integer>
			<key>packageid</key>
			<string>com.microsoft.office.entourage_help_std.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_entourage_help_hse_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>448</integer>
			<key>packageid</key>
			<string>com.microsoft.office.entourage_help_hse.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_entourage_help_era_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>836</integer>
			<key>packageid</key>
			<string>com.microsoft.office.entourage_help_era.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_slt_standalone_entourage_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>316</integer>
			<key>packageid</key>
			<string>com.microsoft.office.slt_standalone_entourage.pkg</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_messenger_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>24</integer>
			<key>packageid</key>
			<string>com.microsoft.office.messenger.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_danish_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>24</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.danish.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_dutch_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>24</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.dutch.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_english_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>3188</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.english.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_finnish_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>24</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.finnish.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_french_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>2644</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.french.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_german_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>2924</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.german.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_italian_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>2296</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.italian.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_japanese_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>544</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.japanese.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_norwegian_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>40</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.norwegian.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_portuguese_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>24</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.portuguese.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_brazilian_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>972</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.brazilian.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_spanish_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>32</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.spanish.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_swedish_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>32</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.swedish.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_clipart_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>packageid</key>
			<string>com.microsoft.office.clipart.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_equationeditor_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>976</integer>
			<key>packageid</key>
			<string>com.microsoft.office.equationeditor.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_graph_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>6036</integer>
			<key>packageid</key>
			<string>com.microsoft.office.graph.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_ooxml_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>98968</integer>
			<key>packageid</key>
			<string>com.microsoft.office.ooxml.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_orgchart_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>2656</integer>
			<key>packageid</key>
			<string>com.microsoft.office.orgchart.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_sounds_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>packageid</key>
			<string>com.microsoft.office.sounds.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_core_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>233556</integer>
			<key>packageid</key>
			<string>com.microsoft.office.core.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_silverlight_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>packageid</key>
			<string>com.microsoft.office.silverlight.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_helpviewer_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>1236</integer>
			<key>packageid</key>
			<string>com.microsoft.office.helpviewer.pkg</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_errorreporting_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>3812</integer>
			<key>packageid</key>
			<string>com.microsoft.office.errorreporting.pkg</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_fonts_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>packageid</key>
			<string>com.microsoft.office.fonts.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_automator_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>18580</integer>
			<key>packageid</key>
			<string>com.microsoft.office.automator.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_automator_workflow_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>764</integer>
			<key>packageid</key>
			<string>com.microsoft.office.automator_workflow.pkg.12.1.0.combo</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_quit_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>8</integer>
			<key>packageid</key>
			<string>com.microsoft.office.quit.pkg</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_slt_hse_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>416</integer>
			<key>packageid</key>
			<string>com.microsoft.office.slt_hse.pkg</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_slt_std_12.1.0.combo.pkg</string>
			<key>installed_size</key>
			<integer>316</integer>
			<key>packageid</key>
			<string>com.microsoft.office.slt_std.pkg</string>
			<key>version</key>
			<string>12.1.0</string>
		</dict>
	</array>
	<key>requires</key>
	<array>
		<string>Office2008-12.0.0</string>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>update_for</key>
	<array>
		<string>Office2008</string>
	</array>
	<key>version</key>
	<string>12.1.0</string>
</dict>
</plist>
