<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>Realplayer</string>
	</array>
	<key>description</key>
	<string></string>
	<key>display_name</key>
	<string>RealPlayer</string>
	<key>installed_size</key>
	<integer>41724</integer>
	<key>installer_item_hash</key>
	<string>d4f6f115364738e43c3d3314c47b33ce0f9eb3962b9f77ffccf7a456054add54</string>
	<key>installer_item_location</key>
	<string>Realplayer/12/RealPlayer.dmg</string>
	<key>installer_item_size</key>
	<integer>15276</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>RealPlayer</string>
	<key>installs</key>
	<array>
	  <dict>
	    <key>CFBundleIdentifier</key>
	    <string>com.RealNetworks.RealPlayer</string>
	    <key>CFBundleName</key>
	    <string>RealPlayer</string>
	    <key>CFBundleShortVersionString</key>
	    <string>12.0.0</string>
	    <key>path</key>
	    <string>/Applications/RealPlayer.app</string>
	    <key>type</key>
	    <string>application</string>
	    </dict>
	</array>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>realplayer.pkg</string>
			<key>installed_size</key>
			<integer>41364</integer>
			<key>packageid</key>
			<string>edu.columbia.realplayer.RealPlayer.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>realnetworks.pkg</string>
			<key>installed_size</key>
			<integer>360</integer>
			<key>packageid</key>
			<string>edu.columbia.RealPlayer.pkg</string>
			<key>version</key>
			<string>12.0</string>
		</dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>12.0</string>
</dict>
</plist>
