<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
	</array>
	<key>description</key>
	<string>Extras for Final Cut Studio 3</string>
	<key>display_name</key>
	<string>final_cut_pro_extras</string>
	<key>installed_size</key>
	<integer>35981468</integer>
	<key>installer_item_hash</key>
	<string>5270e96ad4df1e19a8a3da8c981b4feaf1ab5fc9c002b61b7e74f8bdcd575a4f</string>
	<key>installer_item_location</key>
	<string>Apple/Final Cut Studio/3.0/final_cut_studio_extras.dmg</string>
	<key>installer_item_size</key>
	<integer>32381380</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>final_cut_studio_extras</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>final_cut_studio_extras.pkg</string>
			<key>installed_size</key>
			<integer>35981468</integer>
			<key>packageid</key>
			<string>edu.columbia.final_cut_pro_extras.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>1.0</string>
</dict>
</plist>
