<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple Computer//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>RestartAction</key>
	<string>None</string>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>Thomson_Reuters</string>
	</array>
	<key>description</key>
	<string></string>
	<key>display_name</key>
	<string>EndNote X2</string>
	<key>installed_size</key>
	<integer>232696</integer>
	<key>installer_item_hash</key>
	<string>d8a2891c919c8a8e3dab4846a8076d7c3a9df1ff596992056a5e080115d0d12d</string>
	<key>installer_item_location</key>
	<string>Thomson_Reuters/Endnote/X2/endnotex2.dmg</string>
	<key>installer_item_size</key>
	<integer>61189</integer>
	<key>installs</key>
	<array>
		<dict>
			<key>CFBundleIdentifier</key>
			<string>com.ThomsonResearchSoft.EndNote</string>
			<key>CFBundleShortVersionString</key>
			<string>12.0.0.3548</string>
			<key>path</key>
			<string>/Applications/EndNote X2/EndNote X2.app</string>
			<key>type</key>
			<string>application</string>
		</dict>
	</array>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>EndnoteX2</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>endnotex2.pkg</string>
			<key>installed_size</key>
			<integer>232696</integer>
			<key>packageid</key>
			<string>edu.columbia.EndNoteX2.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
	</array>
	<key>requires</key>
	<array/>
	<key>suppress_bundle_relocation</key>
	<false/>
	<key>unattend_uninstall</key>
	<false/>
	<key>unattended_install</key>
	<false/>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>update_for</key>
	<array/>
	<key>version</key>
	<string>12.0.0</string>
</dict>
</plist>
