<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>charismac</string>
	</array>
	<key>description</key>
	<string>CD and DVD authoring software</string>
	<key>display_name</key>
	<string>Discribe OSX</string>
	<key>installer_item_hash</key>
	<string>f71475bedaf5fd94aed05cb245b3f0fa2ed11e039ead2c9fd6a34790c8370c3a</string>
	<key>installer_item_location</key>
	<string>charismac/discribe/5.3.9/Discribe OSX 5.3.9.dmg</string>
	<key>installer_item_size</key>
	<integer>2150</integer>
	<key>installer_type</key>
	<string>copy_from_dmg</string>
	<key>installs</key>
	<array>
		<dict>
			<key>CFBundleIdentifier</key>
			<string>com.charismac.DiscribeOSX</string>
			<key>CFBundleName</key>
			<string>Discribe OSX</string>
			<key>CFBundleShortVersionString</key>
			<string>5.3.9</string>
			<key>path</key>
			<string>/Applications/Discribe OSX 5.3.9.app</string>
			<key>type</key>
			<string>application</string>
		</dict>
	</array>
	<key>items_to_copy</key>
	<array>
		<dict>
			<key>destination_path</key>
			<string>/Applications</string>
			<key>source_item</key>
			<string>Discribe OSX 5.3.9.app</string>
		</dict>
	</array>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>Discribe OSX</string>
	<key>uninstall_method</key>
	<string>remove_copied_items</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>5.3.9</string>
</dict>
</plist>
