<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>Telestream</string>
	</array>
	<key>description</key>
	<string>ScreenFlow Reg files for Mac mini 06 in the FSL</string>
	<key>display_name</key>
	<string>ScreenFlow Registration</string>
	<key>installed_size</key>
	<integer>8</integer>
	<key>installer_item_hash</key>
	<string>4f318e3f30ab7f35ea025e52ea4810236107080df396a588e7e5c3b877632883</string>
	<key>installer_item_location</key>
	<string>Telestream/ScreenFlow/postinstalls/ccnmtl-postinstall-ScreenFlow_Reg_mini_06.dmg</string>
	<key>installer_item_size</key>
	<integer>22</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>ScreenFlow_Reg_mini_06</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>installed_size</key>
			<integer>4</integer>
			<key>packageid</key>
			<string>edu.columbia.ccnmtl.screenflowRegistration.MindVision.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>installed_size</key>
			<integer>4</integer>
			<key>packageid</key>
			<string>edu.columbia.ccnmtl.screenflowRegistration.net.telestream.screenflow.pkg</string>
			<key>version</key>
			<string>2.0</string>
		</dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>06</string>
</dict>
</plist>
