<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
		<string>snoize</string>
	</array>
	<key>display_name</key>
	<string>MIDI Monitor</string>
	<key>installer_item_hash</key>
	<string>55cca01716fe75198e0d141c301060130d5fb3c9c51bf642c2c20eff81a7996a</string>
	<key>installer_item_location</key>
	<string>snoize/MIDImonitor/1.2.4/MIDIMonitor.dmg</string>
	<key>installer_item_size</key>
	<integer>778</integer>
	<key>installer_type</key>
	<string>copy_from_dmg</string>
	<key>installs</key>
	<array>
		<dict>
			<key>CFBundleIdentifier</key>
			<string>com.snoize.MIDIMonitor</string>
			<key>CFBundleName</key>
			<string>MIDI Monitor</string>
			<key>CFBundleShortVersionString</key>
			<string>1.2.4</string>
			<key>path</key>
			<string>/Applications/MIDI Monitor.app</string>
			<key>type</key>
			<string>application</string>
		</dict>
	</array>
	<key>items_to_copy</key>
	<array>
		<dict>
			<key>destination_path</key>
			<string>/Applications</string>
			<key>source_item</key>
			<string>MIDI Monitor.app</string>
		</dict>
	</array>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>MIDI Monitor</string>
	<key>uninstall_method</key>
	<string>remove_copied_items</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>1.2.4</string>
</dict>
</plist>
