<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>Techspansion</string>
	</array>
	<key>description</key>
	<string>iSquint is an iPod video conversion app for Mac OS X. It's many times faster than QuickTime Pro, works with almost all popular video formats, and it's infinitely free-er.</string>
	<key>display_name</key>
	<string>iSquint</string>
	<key>installer_item_hash</key>
	<string>9cb13fffb47a786f398f4b61760cf17bf09f1e8ce1376169f6e4c7a03670c0fa</string>
	<key>installer_item_location</key>
	<string>Techspansion/iSquint/1.4.3/iSquint.dmg</string>
	<key>installer_item_size</key>
	<integer>4250</integer>
	<key>installer_type</key>
	<string>copy_from_dmg</string>
	<key>installs</key>
	<array>
		<dict>
			<key>CFBundleIdentifier</key>
			<string>org.isquint.isquint</string>
			<key>CFBundleName</key>
			<string>iSquint</string>
			<key>CFBundleShortVersionString</key>
			<string>1.4.3</string>
			<key>path</key>
			<string>/Applications/iSquint.app</string>
			<key>type</key>
			<string>application</string>
		</dict>
	</array>
	<key>items_to_copy</key>
	<array>
		<dict>
			<key>destination_path</key>
			<string>/Applications</string>
			<key>source_item</key>
			<string>iSquint.app</string>
		</dict>
	</array>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>iSquint</string>
	<key>uninstall_method</key>
	<string>remove_copied_items</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>1.4.3</string>
</dict>
</plist>
