<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>RestartAction</key>
	<string>RequireLogout</string>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
	  <string>Adobe</string>
	</array>
	<key>description</key>
	<string></string>
	<key>display_name</key>
	<string>Adobe Acrobat Pro Update</string>
	<key>installer_item_hash</key>
	<string>23b9eaec17026f6f0f89865a9665bc9a5906b61ce1e5a91aa5c64c548388b9e3</string>
	<key>installer_item_location</key>
	<string>Adobe/Acrobat/Patches/AcroProUpd944_all.dmg</string>
	<key>installer_item_size</key>
	<integer>14428</integer>
	<key>installer_type</key>
	<string>AdobeAcrobatUpdater</string>
	<key>installs</key>
	<array>
	  <dict>
	    <key>CFBundleIdentifier</key>
	    <string>com.adobe.Acrobat.Pro</string>
	    <key>CFBundleName</key>
	    <string>Acrobat</string>
	    <key>CFBundleShortVersionString</key>
	    <string>9.4.4</string>
	    <key>path</key>
	    <string>/Applications/Adobe Acrobat 9 Pro/Adobe Acrobat Pro.app</string>
	    <key>type</key>
	    <string>application</string>
	  </dict>
	</array>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>AcrobatPro9Update</string>
        <key>requires</key>
        <array>
          <string>AcrobatPro9Update-9.4.3</string>
        </array>
	<key>uninstallable</key>
	<false/>
	<key>update_for</key>
	<array>
	  <string>Acrobat</string>
	</array>
	<key>version</key>
	<string>9.4.4</string>
</dict>
</plist>
