<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>RestartAction</key>
	<string>RequireLogout</string>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>Adobe</string>
	</array>
	<key>description</key>
	<string></string>
	<key>display_name</key>
	<string>Adobe Acrobat Pro Update</string>
	<key>installer_item_hash</key>
	<string>1a2d6dd7dbad4c519e28a59500466eb2e1b6230a200d44d42e0adc9a8197ee8f</string>
	<key>installer_item_location</key>
	<string>Adobe/Acrobat/Patches/AcroProUpd910_all.dmg</string>
	<key>installer_item_size</key>
	<integer>145584</integer>
	<key>installer_type</key>
	<string>AdobeAcrobatUpdater</string>
	<key>installs</key>
	<array>
	  <dict>
	    <key>CFBundleIdentifier</key>
	    <string>com.adobe.Acrobat.Pro</string>
	    <key>CFBundleName</key>
	    <string>Acrobat</string>
	    <key>CFBundleShortVersionString</key>
	    <string>9.1.0</string>
	    <key>path</key>
	    <string>/Applications/Adobe Acrobat 9 Pro/Adobe Acrobat Pro.app</string>
	    <key>type</key>
	    <string>application</string>
	  </dict>
	</array>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>AcrobatPro9Update</string>
	<key>requires</key>
	<array>
	  <string>Acrobat</string>
        </array>
	<key>uninstallable</key>
	<false/>
	<key>update_for</key>
	<array>
		<string>Acrobat</string>
	</array>
	<key>version</key>
	<string>9.1.0</string>
</dict>
</plist>
