<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple Computer//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>RestartAction</key>
	<string>RequireLogout</string>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>Adobe</string>
	</array>
	<key>description</key>
	<string>Update for Adobe Acrobat Pro</string>
	<key>display_name</key>
	<string>Adobe Acrobat Pro Update</string>
	<key>installer_item_hash</key>
	<string>635558d688b2786d85dde1d616c09ae10fd9418bd955a64f6adb83902a6b4ce8</string>
	<key>installer_item_location</key>
	<string>Adobe/Acrobat/Patches/AcroProUpd950_all.dmg</string>
	<key>installer_item_size</key>
	<integer>71697</integer>
	<key>installer_type</key>
	<string>AdobeAcrobatUpdater</string>
	<key>installs</key>
	<array>
		<dict>
			<key>CFBundleIdentifier</key>
			<string>com.adobe.Acrobat.Pro</string>
			<key>CFBundleName</key>
			<string>Acrobat</string>
			<key>CFBundleShortVersionString</key>
			<string>9.5.0</string>
			<key>path</key>
			<string>/Applications/Adobe Acrobat 9 Pro/Adobe Acrobat Pro.app</string>
			<key>type</key>
			<string>application</string>
		</dict>
	</array>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>AcrobatPro9Update</string>
	<key>postinstall_script</key>
	<string>#!/bin/bash
		/usr/bin/logger &quot;Munki: Running AcrobatPro9Update-9.5.0 postinstall_script...&quot;
		sed -i .bak 's/\&lt;string\&gt;AcroENUPro90SelfHeal\.xml\&lt;\/string\&gt;//g' /Applications/Adobe\ Acrobat\ 9\ Pro/Adobe\ Acrobat\ Pro.app/Contents/MacOS/SHInit.xml
		sed -i .bak 's/\&lt;string\&gt;AcroENUDist90SelfHeal\.xml\&lt;\/string\&gt;//g' /Applications/Adobe\ Acrobat\ 9\ Pro/Acrobat\ Distiller.app/Contents/MacOS/SHInit.xml
			</string>
	<key>preinstall_script</key>
	<string>#!/bin/bash
		/usr/bin/logger &quot;Munki: Running AcrobatPro9Update-9.5.0 preinstall_script...&quot;
		if [ -f /Applications/Adobe\ Acrobat\ 9\ Pro/Adobe\ Acrobat\ Pro.app/Contents/MacOS/SHInit.xml.bak ]; then
		/bin/mv /Applications/Adobe\ Acrobat\ 9\ Pro/Adobe\ Acrobat\ Pro.app/Contents/MacOS/SHInit.xml.bak /Applications/Adobe\ Acrobat\ 9\ Pro/Adobe\ Acrobat\ Pro.app/Contents/MacOS/SHInit.xml
		fi
		if [ -f /Applications/Adobe\ Acrobat\ 9\ Pro/Acrobat\ Distiller.app/Contents/MacOS/SHInit.xml.bak ]; then
		/bin/mv /Applications/Adobe\ Acrobat\ 9\ Pro/Acrobat\ Distiller.app/Contents/MacOS/SHInit.xml.bak /Applications/Adobe\ Acrobat\ 9\ Pro/Acrobat\ Distiller.app/Contents/MacOS/SHInit.xml
		fi
			</string>
	<key>requires</key>
	<array>
		<string>AcrobatPro9Update-9.4.6</string>
	</array>
	<key>uninstallable</key>
	<false/>
	<key>update_for</key>
	<array>
		<string>Acrobat</string>
	</array>
	<key>version</key>
	<string>9.5.0</string>
</dict>
</plist>
