<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>RestartAction</key>
	<string>RequireRestart</string>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
	</array>
	<key>description</key>
	<string></string>
	<key>display_name</key>
	<string>OS X Lion</string>
	<key>installed_size</key>
	<integer>8388608</integer>
	<key>installer_item_hash</key>
	<string>eb979c836082ae4e4c5c41ea171004fd27f32a28fe8684a51d653ce8cf2a9703</string>
	<key>installer_item_location</key>
	<string>Apple/OSX/10.7/InstallLion.dmg</string>
	<key>installer_item_size</key>
	<integer>3659981</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>InstallLion</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>InstallLion.pkg</string>
			<key>installed_size</key>
			<integer>4</integer>
			<key>packageid</key>
			<string>com.googlecode.munki.installlion.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>1.0</string>
</dict>
</plist>
