<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
		<string>mgds</string>
	</array>
	<key>display_name</key>
	<string>GeoMapApp</string>
	<key>installer_item_hash</key>
	<string>9dad2be8a3d3a2f5d82233829c6ee1c88d8624d9783c8d1df851d47452afd442</string>
	<key>installer_item_location</key>
	<string>mgds/Geomapapp/3.0.1/GeoMapApp.dmg</string>
	<key>installer_item_size</key>
	<integer>7454</integer>
	<key>installer_type</key>
	<string>copy_from_dmg</string>
	<key>installs</key>
	<array>
		<dict>
			<key>CFBundleIdentifier</key>
			<string>GeoMapApp</string>
			<key>CFBundleName</key>
			<string>GeoMapApp</string>
			<key>CFBundleShortVersionString</key>
			<string>3.0.1</string>
			<key>path</key>
			<string>/Applications/GeoMapApp.app</string>
			<key>type</key>
			<string>application</string>
		</dict>
	</array>
	<key>items_to_copy</key>
	<array>
		<dict>
			<key>destination_path</key>
			<string>/Applications</string>
			<key>source_item</key>
			<string>GeoMapApp.app</string>
		</dict>
	</array>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>GeoMapApp</string>
	<key>uninstall_method</key>
	<string>remove_copied_items</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>3.0.1</string>
</dict>
</plist>
