<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple Computer//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>AdobeSetupType</key>
	<string>ProductInstall</string>
	<key>RestartAction</key>
	<string>None</string>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
		<string>Adobe</string>
	</array>
	<key>description</key>
	<string></string>
	<key>display_name</key>
	<string>Photoshop Camera Raw</string>
	<key>installed_size</key>
	<integer>2392</integer>
	<key>installer_item_hash</key>
	<string>655a70d672647bce67cd41ccd5695ea5593c9f7bac251ce5bedc745951bda676</string>
	<key>installer_item_location</key>
	<string>Adobe/CS5/Patches/Camera_Raw_6_4_1_updater.dmg</string>
	<key>installer_item_size</key>
	<integer>80623</integer>
	<key>installer_type</key>
	<string>AdobeCS5PatchInstaller</string>
	<key>installs</key>
	<array>
		<dict>
			<key>path</key>
			<string>/Library/Application Support/Adobe/Uninstall/{8248D03C-2213-4D08-9409-0962E47DEA69}.db</string>
			<key>type</key>
			<string>file</string>
		</dict>
	</array>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>PhotoshopCameraRaw</string>
	<key>payloads</key>
	<array>
		<dict>
			<key>AdobeCode</key>
			<string>{8248D03C-2213-4D08-9409-0962E47DEA69}</string>
			<key>display_name</key>
			<string>Photoshop Camera Raw</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>version</key>
			<string>6.4</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{FEA75AFB-4905-43BB-B1D5-5B44D681BFE7}</string>
			<key>display_name</key>
			<string>Camera Profiles Installer</string>
			<key>installed_size</key>
			<integer>2392</integer>
			<key>version</key>
			<string>6.4</string>
		</dict>
	</array>
	<key>requires</key>
	<array/>
	<key>suppress_bundle_relocation</key>
	<false/>
	<key>unattend_uninstall</key>
	<false/>
	<key>unattended_install</key>
	<false/>
	<key>uninstallable</key>
	<false/>
	<key>update_for</key>
	<array>
		<string>CreativeSuite5DesignPremium</string>
		<string>PhotoshopCameraRaw-6.4.0</string>
	</array>
	<key>version</key>
	<string>6.4.1</string>
</dict>
</plist>
