<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple Computer//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>RestartAction</key>
	<string>None</string>
	<key>autoremove</key>
	<false/>
	<key>blocking_applications</key>
	<array>
		<string>Finder</string>
		<string>Firefox</string>
	</array>
	<key>catalogs</key>
	<array>
		<string>cul</string>
		<string>testing</string>
	</array>
	<key>description</key>
	<string>OUTDATED Installs the LITO user and gives it ARD rights. updated for testing other keys.</string>
	<key>display_name</key>
	<string>Remote Desktop Client Update OUTDATED</string>
	<key>installed_size</key>
	<integer>9532</integer>
	<key>installer_item_hash</key>
	<string>5c57eefd620ddadbd2320fb4820aae30186fee2ebe362229b763797cffe13a10</string>
	<key>installer_item_location</key>
	<string>cul/ard/CUL-ard-client.dmg</string>
	<key>installer_item_size</key>
	<integer>4485</integer>
	<key>installs</key>
	<array>
		<dict>
			<key>CFBundleIdentifier</key>
			<string>com.apple.RemoteDesktopAgent</string>
			<key>CFBundleName</key>
			<string>ARDAgent</string>
			<key>CFBundleShortVersionString</key>
			<string>3.4.0</string>
			<key>path</key>
			<string>/System/Library/CoreServices/RemoteManagement/ARDAgent.app</string>
			<key>type</key>
			<string>application</string>
		</dict>
	</array>
	<key>maximum_os_version</key>
	<string>10.6.0</string>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>CUL_ard_client</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>CUL-ard-client.pkg</string>
			<key>installed_size</key>
			<integer>8474</integer>
			<key>name</key>
			<string>RemoteDesktopClient</string>
			<key>packageid</key>
			<string>edu.columbia.pkg.RemoteDesktopClient</string>
			<key>version</key>
			<string>3.4.0.0</string>
		</dict>
	</array>
	<key>requires</key>
	<array/>
	<key>suppress_bundle_relocation</key>
	<false/>
	<key>unattend_uninstall</key>
	<false/>
	<key>unattended_install</key>
	<false/>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>update_for</key>
	<array/>
	<key>version</key>
	<string>3.4.0.0</string>
</dict>
</plist>
