<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>RestartAction</key>
	<string>RequireRestart</string>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>common</string>
		<string>testing</string>
	</array>
	<key>description</key>
	<string></string>
	<key>display_name</key>
	<string>Munki - Managed software installation for OS X</string>
	<key>installed_size</key>
	<integer>1376</integer>
	<key>installer_item_hash</key>
	<string>57b9f9485273420438f46cc1ab896fbf3f01aee169171ba07e9b536611ca81b3</string>
	<key>installer_item_location</key>
	<string>common/munkitools-0.8.0.1351.0.mpkg.dmg</string>
	<key>installer_item_size</key>
	<integer>579</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>munkitools</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>munkitools_core-0.8.0.1351.0.pkg</string>
			<key>installed_size</key>
			<integer>496</integer>
			<key>packageid</key>
			<string>com.googlecode.munki.core</string>
			<key>version</key>
			<string>0.8.0.1351.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>munkitools_admin-0.8.0.1351.0.pkg</string>
			<key>installed_size</key>
			<integer>100</integer>
			<key>packageid</key>
			<string>com.googlecode.munki.admin</string>
			<key>version</key>
			<string>0.8.0.1351.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>munkitools_app-3.2.1342.pkg</string>
			<key>installed_size</key>
			<integer>748</integer>
			<key>packageid</key>
			<string>com.googlecode.munki.app</string>
			<key>version</key>
			<string>3.2.1342</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>munkitools_launchd-0.8.0.1.pkg</string>
			<key>installed_size</key>
			<integer>32</integer>
			<key>packageid</key>
			<string>com.googlecode.munki.launchd</string>
			<key>version</key>
			<string>0.8.0.1</string>
		</dict>
	</array>
	<key>unattended_install</key>
	<false/>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>update_for</key>
	<array>
		<string>munkitools</string>
	</array>
	<key>version</key>
	<string>0.8.0.1351.0</string>
</dict>
</plist>
