<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>RestartAction</key>
	<string>RequireRestart</string>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>common</string>
	</array>
	<key>description</key>
	<string></string>
	<key>display_name</key>
	<string>Munki - Managed software installation for OS X</string>
	<key>installed_size</key>
	<integer>1260</integer>
	<key>installer_item_hash</key>
	<string>009ec562daa250eea93b296e2a1a8b81b4265592687846aabf613aec9c515607</string>
	<key>installer_item_location</key>
	<string>common/munkitools-0.7.2.1243.0.dmg</string>
	<key>installer_item_size</key>
	<integer>559</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>munkitools</string>
	<key>installs</key>
	<array>
	  <dict>
	    <key>CFBundleIdentifier</key>
	    <string>com.googlecode.munki.ManagedSoftwareUpdate</string>
	    <key>CFBundleName</key>
	    <string>Managed Software Update</string>
	    <key>CFBundleShortVersionString</key>
	    <string>3.0.16.1243</string>
	    <key>path</key>
	    <string>/Applications/Utilities/Managed Software Update.app</string>
	    <key>type</key>
	    <string>application</string>
	    </dict>
	  </array>
	<key>receipts</key>
	<array>
	  <dict>
	    <key>filename</key>
	    <string>munkitools_core-0.7.2.1243.0.pkg</string>
	    <key>installed_size</key>
	    <integer>460</integer>
	    <key>packageid</key>
	    <string>com.googlecode.munki.core</string>
	    <key>version</key>
	    <string>0.7.2.1243.0</string>
	  </dict>
	  <dict>
	    <key>filename</key>
	    <string>munkitools_admin-0.7.2.1243.0.pkg</string>
	    <key>installed_size</key>
	    <integer>64</integer>
	    <key>packageid</key>
	    <string>com.googlecode.munki.admin</string>
	    <key>version</key>
	    <string>0.7.2.1243.0</string>
	  </dict>
	  <dict>
	    <key>filename</key>
	    <string>munkitools_app-3.1.2.1243.pkg</string>
	    <key>installed_size</key>
	    <integer>712</integer>
	    <key>packageid</key>
	    <string>com.googlecode.munki.app</string>
	    <key>version</key>
	    <string>3.1.2.1243</string>
	  </dict>
	  <dict>
	    <key>filename</key>
	    <string>munkitools_launchd-0.7.1.pkg</string>
	    <key>installed_size</key>
	    <integer>24</integer>
	    <key>packageid</key>
	    <string>com.googlecode.munki.launchd</string>
	    <key>version</key>
	    <string>0.7.1</string>
	  </dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>0.7.2.1243.0</string>
	<key>update_for</key>
	<array>
	  <string>munkitools</string>
	</array>
	<key>installer_choices_xml</key> 
	<array> 
	  <dict> 
	    <key>attributeSetting</key> 
	    <integer>1</integer> 
	    <key>choiceAttribute</key> 
            <string>selected</string> 
            <key>choiceIdentifier</key> 
            <string>core</string> 
	    </dict>
	  <dict> 
	    <key>attributeSetting</key> 
	    <integer>1</integer> 
	    <key>choiceAttribute</key> 
	    <string>selected</string> 
	    <key>choiceIdentifier</key> 
	    <string>admin</string> 
	    </dict>
	  <dict>
	    <key>attributeSetting</key> 
	    <integer>1</integer> 
	    <key>choiceAttribute</key> 
	    <string>selected</string> 
	    <key>choiceIdentifier</key> 
	    <string>app</string> 
	    </dict>
        <dict>
            <key>attributeSetting</key>
            <integer>0</integer>
            <key>choiceAttribute</key>
            <string>selected</string>
            <key>choiceIdentifier</key>
            <string>launchd</string>
        </dict>
	</array>
	<key>unattended_install</key>
	<true/>
</dict>
</plist>
