<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
		<string>seventhstring</string>
	</array>
	<key>display_name</key>
	<string>Transcribe!</string>
	<key>installer_item_hash</key>
	<string>14bfdb50f15454af941af642a3fd41dd4e94f303db0878e6f293668a34e884cc</string>
	<key>installer_item_location</key>
	<string>seventhstring/Transcribe/8.10/transcribe.dmg</string>
	<key>installer_item_size</key>
	<integer>4896</integer>
	<key>installer_type</key>
	<string>copy_from_dmg</string>
	<key>installs</key>
	<array>
		<dict>
			<key>CFBundleIdentifier</key>
			<string>com.seventhstring.transcribe</string>
			<key>CFBundleShortVersionString</key>
			<string>8.10</string>
			<key>path</key>
			<string>/Applications/Transcribe!.app</string>
			<key>type</key>
			<string>application</string>
		</dict>
	</array>
	<key>items_to_copy</key>
	<array>
		<dict>
			<key>destination_path</key>
			<string>/Applications</string>
			<key>source_item</key>
			<string>Transcribe!.app</string>
		</dict>
	</array>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>Transcribe</string>
	<key>uninstall_method</key>
	<string>remove_copied_items</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>8.10</string>
	<key>requires</key>
	<array>
	  <string>Transcribe License</string>
	</array>
</dict>
</plist>
