<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
		<string>cul</string>
	</array>
	<key>description</key>
	<string></string>
	<key>display_name</key>
	<string>CDRS_FCP_Serialization</string>
	<key>installed_size</key>
	<integer>8</integer>
	<key>installer_item_hash</key>
	<string>1334417ae62a4331bd9440239b7bdb4ed134795f0dfedc4e533465df450dfc2b</string>
	<key>installer_item_location</key>
	<string>cul/serialization/Final Cut Studio/CDRS_FCP_Serialization_Music.dmg</string>
	<key>installer_item_size</key>
	<integer>37</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>CDRS_FCP_Serialzation</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>CDRS_FCP_Serialization_Music.pkg</string>
			<key>installed_size</key>
			<integer>8</integer>
			<key>packageid</key>
			<string>edu.columbia.cdrsfcpserialization.ProApps.pkg</string>
			<key>version</key>
			<string>1.1.0.0.0</string>
		</dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>1.1.0.0.0</string>
</dict>
</plist>
