<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>Apple</string>
	</array>
	<key>description</key>
	<string>Registers FCP for CUL users</string>
	<key>display_name</key>
	<string>Final Cut Studio Serialization</string>
	<key>installed_size</key>
	<integer>8</integer>
	<key>installer_item_hash</key>
	<string>6a4ca86c387f4c6d429cb69202af13ac63f05df10fe0b6281b0551237fe10ea1</string>
	<key>installer_item_location</key>
	<string>cul/serialization/Final Cut Studio/ProApps_Registration.dmg</string>
	<key>installer_item_size</key>
	<integer>166</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>ProApps_Registration</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>ProApps_Registration.pkg</string>
			<key>installed_size</key>
			<integer>8</integer>
			<key>packageid</key>
			<string>edu.columbia.proappsRegistration.proapps.pkg</string>
			<key>version</key>
			<string>1</string>
		</dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>1</string>
</dict>
</plist>
