<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>AdobeSetupType</key>
	<string>ProductInstall</string>
	<key>adobe_install_info</key>
	<dict>
		<key>media_signature</key>
		<string>{CDC977A9-B3BA-4320-BD28-96F2CC91B9E9}</string>
		<key>payload_count</key>
		<integer>73</integer>
		<key>uninstallxml</key>
		<string>&lt;Deployment&gt;
                &lt;Properties&gt;
                    &lt;Property name="mediaSignature"&gt;{CDC977A9-B3BA-4320-BD28-96F2CC91B9E9}&lt;/Property&gt;
                &lt;/Properties&gt;
                &lt;Payloads&gt;
                    &lt;!-- Adobe Illustrator CS5 --&gt;
                    &lt;Payload adobeCode="{6A75E573-6909-4D48-BDFA-D8ED118605A5}"&gt;
                        &lt;Action&gt;remove&lt;/Action&gt;
                    &lt;/Payload&gt;
                    &lt;!-- Adobe Fireworks CS5 --&gt;
                    &lt;Payload adobeCode="{755A9707-8A74-4B18-A6FD-F80F5893BDF2}"&gt;
                        &lt;Action&gt;remove&lt;/Action&gt;
                    &lt;/Payload&gt;
                    &lt;!-- Adobe Photoshop CS5 --&gt;
                    &lt;Payload adobeCode="{7DFEBBA4-81E1-425B-BBAA-06E9E5BBD97E}"&gt;
                        &lt;Action&gt;remove&lt;/Action&gt;
                    &lt;/Payload&gt;
                    &lt;!-- Adobe InDesign CS5 --&gt;
                    &lt;Payload adobeCode="{9EEF9016-4356-11DF-9781-28A32C404F28}"&gt;
                        &lt;Action&gt;remove&lt;/Action&gt;
                    &lt;/Payload&gt;
                    &lt;!-- Adobe Flash Catalyst CS5 --&gt;
                    &lt;Payload adobeCode="{A4EE8093-4250-4D8B-BDE4-A4675BB44953}"&gt;
                        &lt;Action&gt;remove&lt;/Action&gt;
                    &lt;/Payload&gt;
                    &lt;!-- Creative Suite 5 Design Premium --&gt;
                    &lt;Payload adobeCode="{CDC977A9-B3BA-4320-BD28-96F2CC91B9E9}"&gt;
                        &lt;Action&gt;remove&lt;/Action&gt;
                    &lt;/Payload&gt;
                    &lt;!-- Adobe Flash Pro CS5 --&gt;
                    &lt;Payload adobeCode="{CFC9F871-7C40-40B6-BE4A-B98A5B309716}"&gt;
                        &lt;Action&gt;remove&lt;/Action&gt;
                    &lt;/Payload&gt;
                    &lt;!-- Adobe Dreamweaver CS5 --&gt;
                    &lt;Payload adobeCode="{DD5B1FAF-47FA-4B6D-A31C-5E313EB0DD07}"&gt;
                        &lt;Action&gt;remove&lt;/Action&gt;
                    &lt;/Payload&gt;
                &lt;/Payloads&gt;
            &lt;/Deployment&gt;</string>
	</dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>Adobe</string>
	</array>
	<key>description</key>
	<string></string>
	<key>display_name</key>
	<string>Creative Suite Design Premium</string>
	<key>installed_size</key>
	<integer>3145623</integer>
	<key>installer_item_hash</key>
	<string>0ddcaeb2538d9a48588c9ea0280219bbd94f5d070dcc391bc657971fc053b2af</string>
	<key>installer_item_location</key>
	<string>Adobe/CS5/cul-cs5-public.dmg</string>
	<key>installer_item_size</key>
	<integer>3012000</integer>
	<key>installer_type</key>
	<string>AdobeCS5AAMEEPackage</string>
	<key>installs</key>
	<array>
		<dict>
			<key>path</key>
			<string>/Library/Application Support/Adobe/Uninstall/{CDC977A9-B3BA-4320-BD28-96F2CC91B9E9}.db</string>
			<key>type</key>
			<string>file</string>
		</dict>
	</array>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>CreativeSuite5DesignPremium</string>
	<key>payloads</key>
	<array>
		<dict>
			<key>AdobeCode</key>
			<string>{2C8C0585-5083-4032-94B8-A9AD04ED0716}</string>
			<key>display_name</key>
			<string>Adobe AIR</string>
			<key>installed_size</key>
			<integer>59875</integer>
			<key>version</key>
			<string>1.5.3</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{463D65D7-CD43-4FAC-A6C7-7D24CB5DB93B}</string>
			<key>display_name</key>
			<string>Adobe Media Player</string>
			<key>installed_size</key>
			<integer>62278</integer>
			<key>version</key>
			<string>1.8</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{4687A306-D716-4D7A-B0AA-EAB65D17F149}</string>
			<key>display_name</key>
			<string>Adobe Player for Embedding</string>
			<key>installed_size</key>
			<integer>68704</integer>
			<key>version</key>
			<string>3.1</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{0D067D13-C3D7-4EA6-B346-740CD91FD547}</string>
			<key>display_name</key>
			<string>Adobe Bridge CS5</string>
			<key>installed_size</key>
			<integer>226304</integer>
			<key>version</key>
			<string>4</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{DC541ECE-2FFE-11DF-823C-BF762D404F28}</string>
			<key>display_name</key>
			<string>Adobe Buzzword CS5</string>
			<key>installed_size</key>
			<integer>2017</integer>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{37AB3C65-E02C-4DCF-B0E0-4C2E253D8FA3}</string>
			<key>display_name</key>
			<string>Photoshop Camera Raw</string>
			<key>installed_size</key>
			<integer>26855</integer>
			<key>version</key>
			<string>6.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{3F023875-4A52-4605-9DB6-A88D4A813E8D}</string>
			<key>display_name</key>
			<string>Camera Profiles Installer</string>
			<key>installed_size</key>
			<integer>164133</integer>
			<key>version</key>
			<string>6.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{BD0D6363-E961-410F-8BF4-ECD8795F3923}</string>
			<key>display_name</key>
			<string>Adobe CMaps CS5</string>
			<key>installed_size</key>
			<integer>6365</integer>
			<key>version</key>
			<string>3.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{39CB2E53-5326-4939-8B5A-0402C6EFBFE3}</string>
			<key>display_name</key>
			<string>AdobeColorCommonSetCMYK</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>version</key>
			<string>3.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{78A53622-CDBA-49D1-A3D0-D563FB398D0C}</string>
			<key>display_name</key>
			<string>AdobeColorCommonSetRGB</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>version</key>
			<string>3.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{6F29BE46-E5F3-4146-8A84-20301E5C985A}</string>
			<key>display_name</key>
			<string>Adobe Color EU Extra Settings CS5</string>
			<key>installed_size</key>
			<integer>1976</integer>
			<key>version</key>
			<string>3.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{54F4466A-091A-46DA-B697-43D55CEF9DF6}</string>
			<key>display_name</key>
			<string>Adobe Color JA Extra Settings CS5</string>
			<key>installed_size</key>
			<integer>2800</integer>
			<key>version</key>
			<string>3.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{D26EEF95-420A-4726-B85D-AFBE752EF526}</string>
			<key>display_name</key>
			<string>Adobe Color NA Recommended Settings CS5</string>
			<key>installed_size</key>
			<integer>2334</integer>
			<key>version</key>
			<string>3.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{D31D91FE-F0E8-4DF1-812C-9400BE92A386}</string>
			<key>display_name</key>
			<string>Adobe Color - Photoshop Specific CS5</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>version</key>
			<string>3.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{8CCA90E1-F5BA-456F-84BF-AD5FB2CCE13F}</string>
			<key>display_name</key>
			<string>Adobe CSXS Extensions CS5</string>
			<key>installed_size</key>
			<integer>6284</integer>
			<key>version</key>
			<string>2</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{02731921-5711-4E7A-A898-D6BCF0F2A1CD}</string>
			<key>display_name</key>
			<string>Adobe CSXS Infrastructure CS5</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>version</key>
			<string>2</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{CDC977A9-B3BA-4320-BD28-96F2CC91B9E9}</string>
			<key>display_name</key>
			<string>Creative Suite 5 Design Premium</string>
			<key>installed_size</key>
			<integer>2647</integer>
			<key>version</key>
			<string>5.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{6E505C8F-2896-11DF-9B64-0013724DD917}</string>
			<key>display_name</key>
			<string>Adobe Device Central CS5</string>
			<key>installed_size</key>
			<integer>164688</integer>
			<key>version</key>
			<string>3</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{DD5B1FAF-47FA-4B6D-A31C-5E313EB0DD07}</string>
			<key>display_name</key>
			<string>Adobe Dreamweaver CS5</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>version</key>
			<string>11.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{2D5B4A04-0A9F-4FB9-862A-C49400325A90}</string>
			<key>display_name</key>
			<string>Adobe Dreamweaver CS5 LangPack (en_US)</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>version</key>
			<string>11.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{A8798E04-96FF-4564-9157-0D4C89CB794C}</string>
			<key>display_name</key>
			<string>Adobe Dynamiclink Support</string>
			<key>installed_size</key>
			<integer>10628</integer>
			<key>version</key>
			<string>5.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{5A60CD44-B38B-47CD-BE38-219C81AE3345}</string>
			<key>display_name</key>
			<string>Adobe ExtendScript Toolkit CS5</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>version</key>
			<string>3.5.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{E4E188D2-27D5-4E4C-92CE-87F9D24AD2F6}</string>
			<key>display_name</key>
			<string>Adobe Extension Manager CS5</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>version</key>
			<string>5.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{755A9707-8A74-4B18-A6FD-F80F5893BDF2}</string>
			<key>display_name</key>
			<string>Adobe Fireworks CS5</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>version</key>
			<string>11.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{4822EB30-22F2-48A8-9B15-C6DF34BA9CE4}</string>
			<key>display_name</key>
			<string>Adobe Fireworks CS5 English (en_US) Language Pack</string>
			<key>installed_size</key>
			<integer>1902</integer>
			<key>version</key>
			<string>11.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{14A2CC02-4638-405D-8190-ECD7BFD32D6E}</string>
			<key>display_name</key>
			<string>Adobe Flash CS5 Payload LangPack (en_US)</string>
			<key>installed_size</key>
			<integer>124210</integer>
			<key>version</key>
			<string>11.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{CFC9F871-7C40-40B6-BE4A-B98A5B309716}</string>
			<key>display_name</key>
			<string>Adobe Flash Pro CS5</string>
			<key>installed_size</key>
			<integer>430654</integer>
			<key>version</key>
			<string>11.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{A4EE8093-4250-4D8B-BDE4-A4675BB44953}</string>
			<key>display_name</key>
			<string>Adobe Flash Catalyst CS5</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{7745F18B-FD8A-4011-BE16-588900C503D0}</string>
			<key>display_name</key>
			<string>Adobe Flash Fonts1</string>
			<key>installed_size</key>
			<integer>124040</integer>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{E39A5ABD-516B-46F9-A042-694BBA6A4E08}</string>
			<key>display_name</key>
			<string>Adobe Fonts Recommended</string>
			<key>installed_size</key>
			<integer>124042</integer>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{CBDD7465-CE11-4A58-9497-C370B65923F1}</string>
			<key>display_name</key>
			<string>Adobe Fonts Required</string>
			<key>installed_size</key>
			<integer>124041</integer>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{298CF0B0-8B47-46DF-B726-8E4BFAD5432E}</string>
			<key>display_name</key>
			<string>AdobeHelp</string>
			<key>installed_size</key>
			<integer>2441</integer>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{6A75E573-6909-4D48-BDFA-D8ED118605A5}</string>
			<key>display_name</key>
			<string>Adobe Illustrator CS5</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>version</key>
			<string>15.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{B4975576-60AD-4181-AED4-253FC150B404}</string>
			<key>display_name</key>
			<string>Adobe Illustrator CS5 LangPack (en_US)</string>
			<key>installed_size</key>
			<integer>389665</integer>
			<key>version</key>
			<string>15.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{9EEF9016-4356-11DF-9781-28A32C404F28}</string>
			<key>display_name</key>
			<string>Adobe InDesign CS5</string>
			<key>installed_size</key>
			<integer>267811</integer>
			<key>version</key>
			<string>7.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{9BE768D2-3963-11DF-B0A5-B7BA2C404F28}</string>
			<key>display_name</key>
			<string>Adobe InDesign CS5 Application Base Files2</string>
			<key>installed_size</key>
			<integer>69223</integer>
			<key>version</key>
			<string>7.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{935FF832-3963-11DF-9CE8-97BA2C404F28}</string>
			<key>display_name</key>
			<string>Adobe InDesign CS5 Application Feature Set Files (Roman)</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>version</key>
			<string>7.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{8D3FB5B0-395D-11DF-AEA7-642B2C404F28}</string>
			<key>display_name</key>
			<string>Adobe InDesign CS5 Application Language Files (en_US)</string>
			<key>installed_size</key>
			<integer>862</integer>
			<key>version</key>
			<string>7.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{A4747434-3965-11DF-B081-A0842D404F28}</string>
			<key>display_name</key>
			<string>Adobe InDesign CS5 Common Base Files</string>
			<key>installed_size</key>
			<integer>44</integer>
			<key>version</key>
			<string>7.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{68489BE8-3960-11DF-8F88-C4A72C404F28}</string>
			<key>display_name</key>
			<string>Adobe InDesign CS5 Common Language Files (en_US)</string>
			<key>installed_size</key>
			<integer>50641</integer>
			<key>version</key>
			<string>7.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{A44863BF-8DB8-4D22-88DB-5A02BE319840}</string>
			<key>display_name</key>
			<string>Adobe Linguistics CS5</string>
			<key>installed_size</key>
			<integer>38182</integer>
			<key>version</key>
			<string>5.0.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{4438C826-1FD0-4D04-A70B-24FE1580AB21}</string>
			<key>display_name</key>
			<string>Adobe Mini Bridge CS5</string>
			<key>installed_size</key>
			<integer>3654</integer>
			<key>version</key>
			<string>1</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{26B0DF8D-3A8D-4BA9-B131-3B0D9EE87655}</string>
			<key>display_name</key>
			<string>Adobe Flash CS5 Extension - Flash Lite LangPack en_US</string>
			<key>installed_size</key>
			<integer>2115</integer>
			<key>version</key>
			<string>4.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{579FDC01-BA85-49E7-B16A-2C4CB55F7ACD}</string>
			<key>display_name</key>
			<string>Adobe Flash CS5 Extension - Flash Lite LangPack Common</string>
			<key>installed_size</key>
			<integer>1188</integer>
			<key>version</key>
			<string>4.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{925ED7E4-E1B6-4544-8141-1C98A18D2E2E}</string>
			<key>display_name</key>
			<string>Adobe Output Module</string>
			<key>installed_size</key>
			<integer>6398</integer>
			<key>version</key>
			<string>3.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{BAE5212B-6651-4AD8-B26A-1B284D2665C6}</string>
			<key>display_name</key>
			<string>Adobe PDF Library Files CS5</string>
			<key>installed_size</key>
			<integer>69571</integer>
			<key>version</key>
			<string>9.9</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{A2502D10-2D75-4620-8A8B-73F39D5C1243}</string>
			<key>display_name</key>
			<string>PDF Settings CS5</string>
			<key>installed_size</key>
			<integer>590</integer>
			<key>version</key>
			<string>10.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{7DFEBBA4-81E1-425B-BBAA-06E9E5BBD97E}</string>
			<key>display_name</key>
			<string>Adobe Photoshop CS5</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>version</key>
			<string>12.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{69582206-7E5D-4476-A8F4-ECF90E9C8A69}</string>
			<key>display_name</key>
			<string>Adobe Photoshop CS5 English Language Pack</string>
			<key>installed_size</key>
			<integer>36739</integer>
			<key>version</key>
			<string>12.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{0A6FC585-E761-4776-A4F3-BDA1E4FE1B7A}</string>
			<key>display_name</key>
			<string>Adobe Photoshop CS5 Support</string>
			<key>installed_size</key>
			<integer>927</integer>
			<key>version</key>
			<string>12.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{FFEDE6AE-3052-11DF-89B7-E7102C404F28}</string>
			<key>display_name</key>
			<string>Adobe ReviewPanel CS5</string>
			<key>installed_size</key>
			<integer>1800</integer>
			<key>version</key>
			<string>2.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{4C08199E-0D93-4227-8325-F024E71CA7A1}</string>
			<key>display_name</key>
			<string>Adobe SING CS5</string>
			<key>installed_size</key>
			<integer>14845</integer>
			<key>version</key>
			<string>3.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{66173EC7-974E-4652-9468-4A93D2481BF0}</string>
			<key>display_name</key>
			<string>CSXS Story Extension</string>
			<key>installed_size</key>
			<integer>116</integer>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{3423F36D-004F-4DFC-8BCE-07A20B8DFBDE}</string>
			<key>display_name</key>
			<string>Suite Shared Configuration CS5</string>
			<key>installed_size</key>
			<integer>5982</integer>
			<key>version</key>
			<string>2.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{9032BC04-1CB6-11DF-8041-A9C0CF51210B}</string>
			<key>display_name</key>
			<string>Adobe Toolhints CS5</string>
			<key>installed_size</key>
			<integer>407</integer>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{6F3A624B-1B72-4081-96E8-23261F389C5C}</string>
			<key>display_name</key>
			<string>Adobe Type Support CS5</string>
			<key>installed_size</key>
			<integer>5856</integer>
			<key>version</key>
			<string>10.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{796659A8-114A-4E16-9994-14DF6A1B1683}</string>
			<key>display_name</key>
			<string>Adobe Utilities CS5</string>
			<key>installed_size</key>
			<integer>3</integer>
			<key>version</key>
			<string>3.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{73A4DC5E-226E-42BA-8ECA-2822592AC044}</string>
			<key>display_name</key>
			<string>Adobe Color Video Profiles CS CS5</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>version</key>
			<string>3.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{007A2A28-D6A8-4D91-9A2B-568FF8052215}</string>
			<key>display_name</key>
			<string>Adobe WinSoft Linguistics Plugin CS5</string>
			<key>installed_size</key>
			<integer>9486</integer>
			<key>version</key>
			<string>1.2</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{6A2E619B-E4AC-433B-A648-D458CE543A96}</string>
			<key>display_name</key>
			<string>Adobe XMP Panels CS5</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>version</key>
			<string>3.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{F8918124-1CFB-4AB9-9BC2-39B961DBBBEE}</string>
			<key>display_name</key>
			<string>Adobe Pixel Bender Toolkit 2</string>
			<key>installed_size</key>
			<integer>32391</integer>
			<key>version</key>
			<string>2.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{955EB78F-C938-4EA8-8470-C6EA71685834}</string>
			<key>display_name</key>
			<string>AIR2 For Adobe Flash Pro LangPack (en_US)</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>version</key>
			<string>2.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{30221E3E-4C47-4560-A296-DD9ABB500C21}</string>
			<key>display_name</key>
			<string>AIR2 For Adobe Flash Pro</string>
			<key>installed_size</key>
			<integer>121915</integer>
			<key>version</key>
			<string>2.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{47DF3210-E261-4D06-A073-92F6C426C352}</string>
			<key>display_name</key>
			<string>Adobe Media Encoder CS5</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>version</key>
			<string>5.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{5E08533A-2C1B-469D-AFD5-953C9D00031F}</string>
			<key>display_name</key>
			<string>Adobe Browser Lab CS Live</string>
			<key>installed_size</key>
			<integer>236</integer>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{3E7A8DA8-0298-42F2-B927-4DB00E2F8FEE}</string>
			<key>display_name</key>
			<string>LangPack (English) for DeviceCentral</string>
			<key>installed_size</key>
			<integer>293</integer>
			<key>version</key>
			<string>3</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{C7BDD22E-AD27-4B06-BEB9-F97BC4D89671}</string>
			<key>display_name</key>
			<string>Adobe Flash Player 10</string>
			<key>installed_size</key>
			<integer>29793</integer>
			<key>version</key>
			<string>10.1.52.15</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{1EC2407F-6A7B-4A3C-9F46-C812EE3D44FD}</string>
			<key>display_name</key>
			<string>HIL Help Search</string>
			<key>installed_size</key>
			<integer>275</integer>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{635DCFA5-3A47-4452-AEC7-D3B23FFE929D}</string>
			<key>display_name</key>
			<string>Packager for iPhone®</string>
			<key>installed_size</key>
			<integer>134108</integer>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{5C5F61E0-E13B-4FD6-9F4B-C034FFD0672A}</string>
			<key>display_name</key>
			<string>Players For Adobe Flash Pro</string>
			<key>installed_size</key>
			<integer>110449</integer>
			<key>version</key>
			<string>10.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{03EEF3DA-71F9-4FE5-92AD-D10142E26459}</string>
			<key>display_name</key>
			<string>SiteCatalyst® NetAverages™</string>
			<key>installed_size</key>
			<integer>130</integer>
			<key>version</key>
			<string>1</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{4FFA83C0-007A-4DB3-955C-B5EEE73BEDAF}</string>
			<key>display_name</key>
			<string>Adobe SwitchBoard 2.0</string>
			<key>installed_size</key>
			<integer>35</integer>
			<key>version</key>
			<string>2.0</string>
		</dict>
		<dict>
			<key>AdobeCode</key>
			<string>{F1599C36-2EAB-448F-B8F9-7DBEE9D5B345}</string>
			<key>display_name</key>
			<string>TLF For Adobe Flash Pro</string>
			<key>installed_size</key>
			<integer>675</integer>
			<key>version</key>
			<string>1.0</string>
		</dict>
	</array>
	<key>uninstall_method</key>
	<string>AdobeCS5AAMEEPackage</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>5.0</string>
	<key>requires</key>
	<array>
          <string>keyserver</string>
	</array>
</dict>
</plist>
