<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
		<string>Avid</string>
	</array>
	<key>description</key>
	<string></string>
	<key>display_name</key>
	<string>AudioScore Lite</string>
	<key>installed_size</key>
	<integer>288940</integer>
	<key>installer_item_hash</key>
	<string>e270d6f6fdf9e178624ef7ecef87f0cde740c9805388a25004cec1d1aff4b624</string>
	<key>installer_item_location</key>
	<string>Avid/Sibelius/6.0/Install AudioScore Lite-6.5.0.dmg</string>
	<key>installer_item_size</key>
	<integer>31998</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>AudioScore Lite</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>audioscoreLite.pkg</string>
			<key>installed_size</key>
			<integer>288912</integer>
			<key>packageid</key>
			<string>com.Neuratron.AudioScoreLite.pkg</string>
			<key>version</key>
			<string>6.5.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>photse.pkg</string>
			<key>installed_size</key>
			<integer>28</integer>
			<key>packageid</key>
			<string>com.Neuratron.PhotoScoreFont.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>6.5.0</string>
</dict>
</plist>
