<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
		<string>Avid</string>
	</array>
	<key>description</key>
	<string></string>
	<key>display_name</key>
	<string>AudioScore Lite</string>
	<key>installed_size</key>
	<integer>11344</integer>
	<key>installer_item_hash</key>
	<string>7de8891d9b611e5a97b1b9cfdc1ad22e3b33fdd8b5209c03baa98f5c26abbc1e</string>
	<key>installer_item_location</key>
	<string>Avid/Sibelius/6.0/Install AudioScore Lite.dmg</string>
	<key>installer_item_size</key>
	<integer>5138</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>AudioScore Lite</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>audioscoreLite.pkg</string>
			<key>installed_size</key>
			<integer>11316</integer>
			<key>packageid</key>
			<string>com.Neuratron.AudioScoreLite.pkg</string>
			<key>version</key>
			<string>6.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>photse.pkg</string>
			<key>installed_size</key>
			<integer>28</integer>
			<key>packageid</key>
			<string>com.Neuratron.PhotoScoreFont.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>6.0.0</string>
</dict>
</plist>
