<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>Telestream</string>
	</array>
	<key>description</key>
	<string></string>
	<key>display_name</key>
	<string>Telestream Audio</string>
	<key>installed_size</key>
	<integer>168</integer>
	<key>installer_item_hash</key>
	<string>422b555b17a3091c6cc3f16b0f2dfe777494ec17629d87db11975c135cf812f5</string>
	<key>installer_item_location</key>
	<string>Telestream/ScreenFlow/TelestreamAudio_2.1.8.dmg</string>
	<key>installer_item_size</key>
	<integer>53</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>TelestreamAudio</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>installed_size</key>
			<integer>168</integer>
			<key>packageid</key>
			<string>net.telestream.telestreamAudio.mykextdir.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>installed_size</key>
			<integer>0</integer>
			<key>packageid</key>
			<string>net.telestream.telestreamAudio.postflight.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>installed_size</key>
			<integer>0</integer>
			<key>packageid</key>
			<string>net.telestream.telestreamAudio.preflight.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>2.1.18</string>
</dict>
</plist>
