<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>Adobe</string>
	</array>
	<key>description</key>
	<string>Adobe Flash Player</string>
	<key>display_name</key>
	<string>Adobe Flash Player</string>
	<key>installed_size</key>
	<integer>36776</integer>
	<key>installer_item_hash</key>
	<string>a9ecce141ec145d0834ab2ce22f3464261ae6d426bcda8788ddb7411aa1d074d</string>
	<key>installer_item_location</key>
	<string>Adobe/Flash Player/10.3/Adobe Flash Player.dmg</string>
	<key>installer_item_size</key>
	<integer>14035</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>Adobe Flash Player</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>Adobe Flash Player.pkg</string>
			<key>installed_size</key>
			<integer>36776</integer>
			<key>packageid</key>
			<string>com.adobe.pkg.FlashPlayer</string>
			<key>version</key>
			<string>11.1.102.62</string>
		</dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>11.1.102.62</string>
	<key>postinstall_script</key>
	<string>#!/bin/bash
		ADOBEPATH="/Library/Application Support/Macromedia/mms.cfg"
		MESSAGE="AutoUpdateDisable=1"
		touch "$ADOBEPATH"
		echo "$MESSAGE" > "$ADOBEPATH"
	</string>
</dict>
</plist>
