<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>Tagaya_Yoichi</string>
	</array>
	<key>display_name</key>
	<string>R-Name</string>
	<key>installer_item_hash</key>
	<string>3c4c327f11dbd645db5b2f33ef067ec3d94bac8c0940cf720d3030e51599c899</string>
	<key>installer_item_location</key>
	<string>Tagaya_Yoichi/R-Name/3.0/R-Name.dmg</string>
	<key>installer_item_size</key>
	<integer>320</integer>
	<key>installer_type</key>
	<string>copy_from_dmg</string>
	<key>installs</key>
	<array>
		<dict>
			<key>CFBundleName</key>
			<string>R-Name</string>
			<key>CFBundleShortVersionString</key>
			<string>3</string>
			<key>path</key>
			<string>/Applications/R-Name.app</string>
			<key>type</key>
			<string>application</string>
		</dict>
	</array>
	<key>items_to_copy</key>
	<array>
		<dict>
			<key>destination_path</key>
			<string>/Applications</string>
			<key>source_item</key>
			<string>R-Name.app</string>
		</dict>
	</array>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>R-Name</string>
	<key>uninstall_method</key>
	<string>remove_copied_items</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>3.0</string>
</dict>
</plist>
