<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>Microsoft</string>
	</array>
	<key>description</key>
	<string>MS Office 2008 for Mac</string>
	<key>display_name</key>
	<string>Microsoft Office 2008 for Mac</string>
	<key>installed_size</key>
	<integer>1111574</integer>
	<key>installer_item_hash</key>
	<string>07fa4600462ee78762fbdbe207c42e7874d7f7cd72ffbb0b6c0961f03e8158cd</string>
	<key>installer_item_location</key>
	<string>Microsoft/Office/2008/Office2008.dmg</string>
	<key>installer_item_size</key>
	<integer>540385</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>Office2008</string>
	<key>installs</key>
	<array>
          <dict>
            <key>type</key>
            <string>plist</string>
            <key>path</key>
            <string>/Applications/Microsoft Office 2008/Office/MicrosoftComponentPlugin.framework/Resources/Info.plist</string>
            <key>CFBundleShortVersionString</key>
            <string>12.0.0</string>
	  </dict>
	</array>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>Office2008_en_word.pkg</string>
			<key>installed_size</key>
			<integer>140928</integer>
			<key>packageid</key>
			<string>com.microsoft.office.word.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_word_help_std.pkg</string>
			<key>installed_size</key>
			<integer>4576</integer>
			<key>packageid</key>
			<string>com.microsoft.office.word_help_std.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_excel.pkg</string>
			<key>installed_size</key>
			<integer>51768</integer>
			<key>packageid</key>
			<string>com.microsoft.office.excel.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_excel_help_std.pkg</string>
			<key>installed_size</key>
			<integer>10628</integer>
			<key>packageid</key>
			<string>com.microsoft.office.excel_help_std.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_powerpoint.pkg</string>
			<key>installed_size</key>
			<integer>41824</integer>
			<key>packageid</key>
			<string>com.microsoft.office.powerpoint.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_powerpoint_help_std.pkg</string>
			<key>installed_size</key>
			<integer>3612</integer>
			<key>packageid</key>
			<string>com.microsoft.office.powerpoint_help_std.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_entourage.pkg</string>
			<key>installed_size</key>
			<integer>46160</integer>
			<key>packageid</key>
			<string>com.microsoft.office.entourage.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_entourage_help_std.pkg</string>
			<key>installed_size</key>
			<integer>3096</integer>
			<key>packageid</key>
			<string>com.microsoft.office.entourage_help_std.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_messenger.pkg</string>
			<key>installed_size</key>
			<integer>24940</integer>
			<key>packageid</key>
			<string>com.microsoft.office.messenger.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_danish.pkg</string>
			<key>installed_size</key>
			<integer>8548</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.danish.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_dutch.pkg</string>
			<key>installed_size</key>
			<integer>4948</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.dutch.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_english.pkg</string>
			<key>installed_size</key>
			<integer>12292</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.english.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_finnish.pkg</string>
			<key>installed_size</key>
			<integer>6728</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.finnish.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_french.pkg</string>
			<key>installed_size</key>
			<integer>9548</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.french.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_german.pkg</string>
			<key>installed_size</key>
			<integer>34560</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.german.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_italian.pkg</string>
			<key>installed_size</key>
			<integer>24672</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.italian.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_japanese.pkg</string>
			<key>installed_size</key>
			<integer>3508</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.japanese.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_norwegian.pkg</string>
			<key>installed_size</key>
			<integer>15168</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.norwegian.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_portuguese.pkg</string>
			<key>installed_size</key>
			<integer>3776</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.portuguese.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_brazilian.pkg</string>
			<key>installed_size</key>
			<integer>5740</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.brazilian.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_spanish.pkg</string>
			<key>installed_size</key>
			<integer>16764</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.spanish.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_proofing_swedish.pkg</string>
			<key>installed_size</key>
			<integer>14988</integer>
			<key>packageid</key>
			<string>com.microsoft.office.proofingtools.swedish.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_core.pkg</string>
			<key>installed_size</key>
			<integer>313476</integer>
			<key>packageid</key>
			<string>com.microsoft.office.core.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_clipart.pkg</string>
			<key>installed_size</key>
			<integer>120728</integer>
			<key>packageid</key>
			<string>com.microsoft.office.clipart.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_equationeditor.pkg</string>
			<key>installed_size</key>
			<integer>2176</integer>
			<key>packageid</key>
			<string>com.microsoft.office.equationeditor.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_graph.pkg</string>
			<key>installed_size</key>
			<integer>9304</integer>
			<key>packageid</key>
			<string>com.microsoft.office.graph.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_ooxml.pkg</string>
			<key>installed_size</key>
			<integer>115464</integer>
			<key>packageid</key>
			<string>com.microsoft.office.ooxml.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_orgchart.pkg</string>
			<key>installed_size</key>
			<integer>3488</integer>
			<key>packageid</key>
			<string>com.microsoft.office.orgchart.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_sounds.pkg</string>
			<key>installed_size</key>
			<integer>5180</integer>
			<key>packageid</key>
			<string>com.microsoft.office.sounds.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_launch.pkg</string>
			<key>installed_size</key>
			<integer>16</integer>
			<key>packageid</key>
			<string>com.microsoft.office.launch.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_silverlight.pkg</string>
			<key>installed_size</key>
			<integer>20</integer>
			<key>packageid</key>
			<string>com.microsoft.office.silverlight.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_required.pkg</string>
			<key>installed_size</key>
			<integer>204</integer>
			<key>packageid</key>
			<string>com.microsoft.office.required.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_autoupdate.pkg</string>
			<key>installed_size</key>
			<integer>2780</integer>
			<key>packageid</key>
			<string>com.microsoft.office.autoupdate.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_errorreporting.pkg</string>
			<key>installed_size</key>
			<integer>3792</integer>
			<key>packageid</key>
			<string>com.microsoft.office.errorreporting.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_helpviewer.pkg</string>
			<key>installed_size</key>
			<integer>1184</integer>
			<key>packageid</key>
			<string>com.microsoft.office.helpviewer.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_fonts.pkg</string>
			<key>installed_size</key>
			<integer>117632</integer>
			<key>packageid</key>
			<string>com.microsoft.office.fonts.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_automator.pkg</string>
			<key>installed_size</key>
			<integer>31320</integer>
			<key>packageid</key>
			<string>com.microsoft.office.automator.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_automator_workflow.pkg</string>
			<key>installed_size</key>
			<integer>640</integer>
			<key>packageid</key>
			<string>com.microsoft.office.automator_workflow.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2008_en_dock.pkg</string>
			<key>installed_size</key>
			<integer>16</integer>
			<key>packageid</key>
			<string>com.microsoft.office.dock.pkg</string>
			<key>version</key>
			<string>12.0.0</string>
		</dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>12.0.0</string>
	<key>postinstall_script</key>
	<string>#!/bin/sh
/bin/rm '/Applications/Microsoft Office 2008/Office/SetupInfo.plist'
exit 0
	</string>


</dict>
</plist>
