<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>cul</string>
	</array>
	<key>description</key>
	<string></string>
	<key>display_name</key>
	<string>iTunesAgreementByPass</string>
	<key>installed_size</key>
	<integer>4</integer>
	<key>installer_item_hash</key>
	<string>f94e139a90162de50517051397f19463e6ecb8c5058e8ab798186d3f9150759f</string>
	<key>installer_item_location</key>
	<string>cul/customization/itunes/iTunesAgreementByPass.dmg</string>
	<key>installer_item_size</key>
	<integer>12</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>iTunesAgreementByPass</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>iTunesAgreementByPass.pkg</string>
			<key>installed_size</key>
			<integer>4</integer>
			<key>packageid</key>
			<string>edu.columbia.itunesagreementbypass.itunesplist.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>1.0</string>
</dict>
</plist>
