<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>MSLab</string>
	</array>
	<key>description</key>
	<string>Office 2011 14.0.2 Update</string>
	<key>display_name</key>
	<string>Office 2011 14.0.2 Update</string>
	<key>installed_size</key>
	<integer>353524</integer>
	<key>installer_item_hash</key>
	<string>25dcdfc1c9fc82290b31d9f5020c75e158cb6c47921ce96cd35128b1e6c1d465</string>
	<key>installer_item_location</key>
	<string>Microsoft/Office/2011/Patches/Office2011-1402UpdateEN.dmg</string>
	<key>installer_item_size</key>
	<integer>113171</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>Office2011UpdateLab</string>
        <key>installs</key>
        <array>
          <dict>
            <key>type</key>
            <string>plist</string>
            <key>path</key>
            <string>/Applications/Microsoft Office 2011/Office/MicrosoftComponentPlugin.framework/Resources/Info.plist</string>
            <key>CFBundleShortVersionString</key>
            <string>14.0.2</string>
          </dict>
        </array>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>Office2011_en_autoupdate_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>2240</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.autoupdate.pkg.14.0.0</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_word_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>39256</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.word.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_excel_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>31264</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.excel.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_powerpoint_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>20960</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.powerpoint.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_vb_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>7988</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.vb.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_dcc_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>1956</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.dcc.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_fonts_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>24</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.fonts.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_errorreporting_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>2888</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.errorreporting.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_quit_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>12</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.quit.pkg.14.0.0</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_clipart_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>4620</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.clipart.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_graph_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>3752</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.graph.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_sharepointbrowserplugin_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>208</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.sharepointbrowserplugin.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_ooxml_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>22952</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.ooxml.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_sounds_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>16</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.sounds.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_proofing_catalan_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>612</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.proofingtools.catalan.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_proofing_danish_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>612</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.proofingtools.danish.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_proofing_dutch_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>612</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.proofingtools.dutch.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_proofing_english_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>2052</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.proofingtools.english.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_proofing_french_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>1596</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.proofingtools.french.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_proofing_german_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>2100</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.proofingtools.german.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_proofing_italian_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>612</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.proofingtools.italian.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_proofing_japanese_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>284</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.proofingtools.japanese.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_proofing_norwegian_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>1224</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.proofingtools.norwegian.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_proofing_portuguese_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>612</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.proofingtools.portuguese.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_proofing_brazilian_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>612</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.proofingtools.brazilian.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_proofing_spanish_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>612</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.proofingtools.spanish.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_proofing_swedish_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>612</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.proofingtools.swedish.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_proofing_czech_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>612</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.proofingtools.czech.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_proofing_polish_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>612</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.proofingtools.polish.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_proofing_russian_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>612</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.proofingtools.russian.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_proofing_turkish_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>612</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.proofingtools.turkish.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>Office2011_en_core_14.0.2.combo.pkg</string>
			<key>installed_size</key>
			<integer>138464</integer>
			<key>packageid</key>
			<string>com.microsoft.office.en.core.pkg.14.0.0.update</string>
			<key>version</key>
			<string>14.0.2</string>
		</dict>
	</array>
	<key>requires</key>
	<array>
		<string>Office2011Lab-14.0.0</string>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>update_for</key>
	<array>
		<string>Office2011Lab</string>
	</array>
	<key>version</key>
	<string>14.0.2</string>
	<key>installer_choices_xml</key>
        <array>
          <dict>
          <key>attributeSetting</key>
          <integer>0</integer>
          <key>choiceAttribute</key>
          <string>selected</string>
          <key>choiceIdentifier</key>
          <string>outlook</string>
          </dict>
          <dict>
            <key>attributeSetting</key>
            <integer>0</integer>
            <key>choiceAttribute</key>
            <string>selected</string>
            <key>choiceIdentifier</key>
            <string>messenger</string>
            </dict>
          <dict>
            <key>attributeSetting</key>
            <integer>0</integer>
            <key>choiceAttribute</key>
            <string>selected</string>
            <key>choiceIdentifier</key>
            <string>communicator</string>
            </dict>
        </array>
</dict>
</plist>
