<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
	  <string>testing</string>
	  <string>Solero</string>
	</array>
	<key>description</key>
	<string>Solero FreehandViewer for Naxos Music Library resources</string>
	<key>display_name</key>
	<string>FreeHand Viewer 1.5.7.0</string>
	<key>installed_size</key>
	<integer>19304</integer>
	<key>installer_item_hash</key>
	<string>9b5e8b5cd3009181de24d416cfc77f4f4816bc272c68433eb8a0b6ca1d3c3087</string>
	<key>installer_item_location</key>
	<string>Solero/FreehandViewer/1.5.7/freehandviewer1.5.7.dmg</string>
	<key>installer_item_size</key>
	<integer>10532</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>FreehandViewer</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>freehandViewer1570Preflight.pkg</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>packageid</key>
			<string>com.freehandmusic.freehandViewer1570.preflight.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>freehandViewer.pkg</string>
			<key>installed_size</key>
			<integer>18512</integer>
			<key>packageid</key>
			<string>com.freehandmusic.freehandViewer1570.FreeHandViewer.pkg</string>
			<key>version</key>
			<string>1.5.7.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>jazz.pkg</string>
			<key>installed_size</key>
			<integer>64</integer>
			<key>packageid</key>
			<string>com.freehandmusic.freehandViewer1570.Jazz.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>jazzcord.pkg</string>
			<key>installed_size</key>
			<integer>124</integer>
			<key>packageid</key>
			<string>com.freehandmusic.freehandViewer1570.JazzCord.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>jazzperc.pkg</string>
			<key>installed_size</key>
			<integer>28</integer>
			<key>packageid</key>
			<string>com.freehandmusic.freehandViewer1570.JazzPerc.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>jazztext.pkg</string>
			<key>installed_size</key>
			<integer>60</integer>
			<key>packageid</key>
			<string>com.freehandmusic.freehandViewer1570.JazzText.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>jazztextextended.pkg</string>
			<key>installed_size</key>
			<integer>32</integer>
			<key>packageid</key>
			<string>com.freehandmusic.freehandViewer1570.JazzTextExtended.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>krini.pkg</string>
			<key>installed_size</key>
			<integer>28</integer>
			<key>packageid</key>
			<string>com.freehandmusic.freehandViewer1570.Krini.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>krinitsk.pkg</string>
			<key>installed_size</key>
			<integer>28</integer>
			<key>packageid</key>
			<string>com.freehandmusic.freehandViewer1570.Krinitsk.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>musical.pkg</string>
			<key>installed_size</key>
			<integer>40</integer>
			<key>packageid</key>
			<string>com.freehandmusic.freehandViewer1570.Musical.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>musicalsymbols.pkg</string>
			<key>installed_size</key>
			<integer>80</integer>
			<key>packageid</key>
			<string>com.freehandmusic.freehandViewer1570.MusicalSymbols.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>sinfonia.pkg</string>
			<key>installed_size</key>
			<integer>68</integer>
			<key>packageid</key>
			<string>com.freehandmusic.freehandViewer1570.Sinfonia.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>sampleScore1.pkg</string>
			<key>installed_size</key>
			<integer>96</integer>
			<key>packageid</key>
			<string>com.freehandmusic.freehandViewer1570.SampleScore1.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>sampleScore2.pkg</string>
			<key>installed_size</key>
			<integer>144</integer>
			<key>packageid</key>
			<string>com.freehandmusic.freehandViewer1570.SampleScore2.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>freehandViewer1570Postflight.pkg</string>
			<key>installed_size</key>
			<integer>0</integer>
			<key>packageid</key>
			<string>com.freehandmusic.freehandViewer1570.postflight.pkg</string>
			<key>version</key>
			<string>1.0</string>
		</dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>1.5.7.0</string>
</dict>
</plist>
