<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>cul</string>
	</array>
	<key>description</key>
	<string>Uni Login for Staff Machines</string>
	<key>display_name</key>
	<string>UNI Login For Staff</string>
	<key>installed_size</key>
	<integer>688</integer>
	<key>installer_item_hash</key>
	<string>0c96440109ee37326907fec413f04e7368f2a8dcefc38588912252b25f2ae493</string>
	<key>installer_item_location</key>
	<string>cul/uni_login/cul-uni_login_files.dmg</string>
	<key>installer_item_size</key>
	<integer>246</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>cul_uni_login_files</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>management.pkg</string>
			<key>installed_size</key>
			<integer>32</integer>
			<key>packageid</key>
			<string>edu.columbia.uniloginfiles.management.pkg</string>
			<key>version</key>
			<string>1</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>ihook.pkg</string>
			<key>installed_size</key>
			<integer>620</integer>
			<key>packageid</key>
			<string>edu.columbia.uniloginfiles.ihook.pkg</string>
			<key>version</key>
			<string>1</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>comappleloginwindow.pkg</string>
			<key>installed_size</key>
			<integer>4</integer>
			<key>packageid</key>
			<string>edu.columbia.uniloginfiles.comappleloginwindow.pkg</string>
			<key>version</key>
			<string>1</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>authorization.pkg</string>
			<key>installed_size</key>
			<integer>28</integer>
			<key>packageid</key>
			<string>edu.columbia.uniloginfiles.authorization.pkg</string>
			<key>version</key>
			<string>1</string>
		</dict>
		<dict>
			<key>filename</key>
			<string>edumit.pkg</string>
			<key>installed_size</key>
			<integer>4</integer>
			<key>packageid</key>
			<string>edu.columbia.uniloginfiles.edumit.pkg</string>
			<key>version</key>
			<string>1</string>
		</dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>1.0.0.0.0</string>
</dict>
</plist>
