<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>Boxee</string>
	</array>
	<key>description</key>
	<string></string>
	<key>display_name</key>
	<string>Boxee</string>
	<key>installed_size</key>
	<integer>135536</integer>
	<key>installer_item_hash</key>
	<string>301d3129cbadfb8dbd1843f0c27bdaff34a37c92503491c0c428900437269078</string>
	<key>installer_item_location</key>
	<string>Boxee/boxee-0.9.23.15885.dmg</string>
	<key>installer_item_size</key>
	<integer>53633</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>boxee</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>boxee.pkg</string>
			<key>installed_size</key>
			<integer>135536</integer>
			<key>packageid</key>
			<string>boxee.tv.boxee.pkg</string>
			<key>version</key>
			<string>0.9.23.15885</string>
		</dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>0.9.23.15885</string>
</dict>
</plist>
