<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>Adobe</string>
	</array>
	<key>description</key>
	<string>Adobe Flash Player-11.0.1.152</string>
	<key>display_name</key>
	<string>Adobe Flash Player</string>
	<key>installed_size</key>
	<integer>36752</integer>
	<key>installer_item_hash</key>
	<string>7ce7b618c200d8376a90f386feeda3a6c22a0885d58db3db9a563de9e44907ad</string>
	<key>installer_item_location</key>
	<string>Adobe/Flash Player/Adobe Flash Player-11.0.1.152.dmg</string>
	<key>installer_item_size</key>
	<integer>14245</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>Adobe Flash Player</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>filename</key>
			<string>Adobe Flash Player.pkg</string>
			<key>installed_size</key>
			<integer>36752</integer>
			<key>packageid</key>
			<string>com.adobe.pkg.FlashPlayer</string>
			<key>version</key>
			<string>11.0.1.152</string>
		</dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>11.0.1.152</string>
	<key>postinstall_script</key>
        <string>#!/bin/bash
ADOBEPATH="/Library/Application Support/Macromedia/mms.cfg"
MESSAGE="AutoUpdateDisable=1"
touch "$ADOBEPATH"
echo "$MESSAGE" &gt; "$ADOBEPATH"</string>
</dict>
</plist>
