<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
		<string>Twitter</string>
	</array>
	<key>display_name</key>
	<string>TweedDeck</string>
	<key>installer_item_hash</key>
	<string>a07692a53f9ba1b77b22ccd9bae08894ed187a7b548f39a14e031e32149650fc</string>
	<key>installer_item_location</key>
	<string>Twitter/TweetDeck/0.38.1/TweetDeck.dmg</string>
	<key>installer_item_size</key>
	<integer>2395</integer>
	<key>installer_type</key>
	<string>copy_from_dmg</string>
	<key>installs</key>
	<array>
		<dict>
			<key>CFBundleIdentifier</key>
			<string>TweetDeckFast.FFF259DC0CE2657847BBB4AFF0E62062EFC56543.1</string>
			<key>CFBundleShortVersionString</key>
			<string>0.38.1</string>
			<key>minosversion</key>
			<string>10.4</string>
			<key>path</key>
			<string>/Applications/TweetDeck.app</string>
			<key>type</key>
			<string>application</string>
		</dict>
	</array>
	<key>items_to_copy</key>
	<array>
		<dict>
			<key>destination_path</key>
			<string>/Applications</string>
			<key>source_item</key>
			<string>TweetDeck.app</string>
		</dict>
	</array>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>TweetDeck</string>
	<key>uninstall_method</key>
	<string>remove_copied_items</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>0.38.1</string>
</dict>
</plist>
