<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>Adobe</string>
	</array>
	<key>description</key>
	<string></string>
	<key>display_name</key>
	<string>Adobe Acrobat 9 Pro</string>
	<key>installed_size</key>
	<integer>1039968</integer>
	<key>installer_item_hash</key>
	<string>07eadc1ee0f2f17b75de91e9949cf7f652c48e958dfe941aca7de3e58fd5699f</string>
	<key>installer_item_location</key>
	<string>Adobe/Acrobat/9.0/Acrobat9.0.dmg</string>
	<key>installer_item_size</key>
	<integer>429045</integer>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>name</key>
	<string>Acrobat</string>
        <key>installs</key>
        <array>
          <dict>
            <key>CFBundleIdentifier</key>
            <string>com.adobe.Acrobat.Pro</string>
            <key>CFBundleName</key>
            <string>Acrobat</string>
            <key>CFBundleShortVersionString</key>
            <string>9.0.0</string>
            <key>path</key>
            <string>/Applications/Adobe Acrobat 9 Pro/Adobe Acrobat Pro.app</string>
            <key>type</key>
            <string>application</string>
          </dict>
	  <dict>
	    <key>md5checksum</key>
	      <string>679f9f0a0e3f7872a6bf85bb6380b325</string>
	      <key>path</key>
	      <string>/Applications/Adobe Acrobat 9 Pro/Adobe Acrobat Pro.app/Contents/Resources/AMT/application.xml.override</string>
	      <key>type</key>
	      <string>file</string>
	  </dict>
        </array>
	<key>receipts</key>
	<array>
	  <dict>
	    <key>filename</key>
	    <string>Acrobat9.0.pkg</string>
	    <key>installed_size</key>
	    <integer>1039968</integer>
	    <key>packageid</key>
	    <string>edu.columbia.adobeAcrobat9Pro.pkg</string>
	    <key>version</key>
	    <string>9.0.0.0.0</string>
	  </dict>
	</array>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>9.0.0.0.0</string>
</dict>
</plist>
